Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.ModelWithNoOccupiedSpacesWarn Property
 The model has no occupiable spaces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ModelWithNoOccupiedSpacesWarn { get; }
Public Shared ReadOnly Property ModelWithNoOccupiedSpacesWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ModelWithNoOccupiedSpacesWarn {
	FailureDefinitionId^ get ();
}
static member ModelWithNoOccupiedSpacesWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace